🚀&nbsp; env0 had composed a PR Plan for environment [ACME Financial Services / ZZ. Dev Playground / Kosta / Shenanigans / acme-demo simple-ec2-instance ](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/52c05cc1-c80f-48b5-8c56-eacc2b7342f7?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-0cd202468248306f2" -> "ami-0a15226b1f7f23580" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:244172364962:instance/i-00a3d8a53ca05e968" -> (known after apply)
!       availability_zone                    = "us-west-2b" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-00a3d8a53ca05e968" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-0af5cbb5de8bc39d5" -> (known after apply)
!       private_dns                          = "ip-10-0-3-165.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.3.165" -> (known after apply)
+       public_dns                           = (known after apply)
!       public_ip                            = "54.185.159.91" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"      = "Dec 31" -> "May 20"
            "Name"      = "env0-acme-ec2"
            "Owner"     = "acme demo org"
            "Terraform" = "true"
!           "Test"      = "new tag" -> "new tagas"
        }
!       tags_all                             = {
!           "Demo"      = "Dec 31" -> "May 20"
!           "Test"      = "new tag" -> "new tagas"
            # (3 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-08fdaac30443c7649",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

-       enclave_options {
-           enabled = false -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/sda1" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-017793bccfdafd96d" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-00a3d8a53ca05e968",
+       (known after apply),
    ]
!   private_ip = [
-       "10.0.3.165",
+       (known after apply),
    ]
!   public_ip  = [
-       "54.185.159.91",
+       (known after apply),
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ENV0_INSTALLED_TOOLS"
│ but a value was found in file "env0.auto.tfvars.json". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/52c05cc1-c80f-48b5-8c56-eacc2b7342f7/deployments/2b95c90f-afa5-4c69-b7df-a4727804b8c7?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[Get instant insights with AI Summary](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/52c05cc1-c80f-48b5-8c56-eacc2b7342f7/deployments/2b95c90f-afa5-4c69-b7df-a4727804b8c7?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)